[{"title":"别让手机偷走孩子的注意力","date":"2019-06-17T01:12:52.000Z","path":"2019/06/17/别让手机偷走孩子的注意力/","text":"“妈妈，我好无聊，我要看手机。” 每当这个时候，大部分家长都经不住孩子的哼唧，也认为看个十几分钟没多大关系，于是掏出手机，递给孩子，换自己一阵安静。 尤其是在排队时、等吃饭时、写完作业后，这些无聊的碎片时间，孩子更是坐立不安。 但这些被手机侵占的碎片时间，却正在拉开孩子间的距离。 你的做法里，藏着孩子二十年后的未来。 去年春季，一篇名为《别让手机偷走你的梦想》的演讲火爆朋友圈，南京第九中学的张恒柱校长在演讲里，让所有父母和孩子警惕，不要沦为“手机控”。 在今年春季的开学典礼上，张恒柱校长再次指出一个很严肃的事实： “今天，我们的社会已始进入泛娱乐化时代，我们时刻被海量信息包围着，想安静地看会儿书，做几道题，手机来了消息，网页跳出弹窗，不是这个明星绯闻，就是“速看、震惊”这些标题党。 但等你打开，满足好奇心后，看书学习这件事，早已被冲击得支离破碎。” 是的，在这个信息爆炸的时代，只要我们一有时间，注意力都被手机占去了。 孩子长时间浸泡在手机提供的“低思考、高娱乐、低成本、高回报”的感官刺激里，有多少孩子还能够投入到枯燥的、需要不断努力才能看到成果的学习中去？ 然而，我们依旧在允许手机吞噬孩子的注意力。2016年的一个调查数据显示，家长平均每天愿意给孩子使用移动终端的累计时长约为40分钟。 泛娱乐化的时代，孩子的注意力正在被手机偷走。 注意力被偷走的孩子，正在离成功越来越远。 美国心理学家朱利安·斯坦利在1971年启动了一个超常儿童研究项目，在45年时间里跟踪了美国五千名全国排名1%的超常儿童的职业和成就。 研究结果证明，这五千名儿童绝大部分成为了一流的科学家、世界500强的CEO、联邦法官，包括扎克伯格、谢尔盖·布林等人。 研究发现，专注力和整个学习的关联性远高于智商，一个人越专注，他将来获得成就的比例就越高。 泛娱乐化时代，当大家的注意力都被碎片化阅读和爆炸性信息吞噬时，长时间的专注能力，已成为孩子最重要的竞争力之一。 如何提高注意力如何提高孩子的注意力？并不是不让孩子看手机就可以了。 “你给我专心点！” “看这里，别看其他地方！” “你又干嘛去了，快回来写作业！” 哪怕孩子被你压在书桌前，自身专注力不够的孩子，还是一样会走神。 要从根本上提升孩子的注意力，首先要科学地认知注意力。 关于人类注意力的基本规则和普遍情况，澳大利亚的心理学家莉·沃特斯在其著作《优势教养》中给出了这样的一组数据： 儿童，毫无疑问，不擅长集中和保持注意力，多数3岁的孩子只能保持专注3~5分钟。 在6~12岁之间，孩子的注意力会有一个突飞猛进的发展期，孩子的专注时间可以提高到10分钟左右。 在15岁左右，注意力集中能力又会有一个飞跃，这是大脑发展和髓鞘化增多的结果，让我们的注意力可以保持20~25分钟。 此后，我们的注意力水平趋于稳定，所以作为成年人，我们的注意力水平并没有比青少年时高很多。 据沃特斯博士介绍，成年人工作时之所以能够一直专注在电脑或工作台前，并不是我们能连续好几个小时保持专注，而是我们在不断地重新集中注意力，重新保持专注。 回想一下，当我们来到办公室后，打开电脑，专注一段时间后，也会随手喝口水，也会两眼看看远处思考另一个问题，也会突然想到早上忘记提醒孩子带水杯，只是我们又能很快地专注回来罢了。 而我们经常要求孩子把注意力集中在一件事情上，并长时间保持这种状态，不因为别的事情分心。 我们的要求太高了。 这样不是在提高孩子的注意力，而是在强迫他们坐在书桌前而已。 真正提高孩子的注意力，应该是引导孩子自发地十分专注于某一件事，让他增强这个能力。 美国心理学家朱利安· 斯坦利的研究中也指出，学生只有达到在外界看起来十分专注、刻苦、自觉的学习，而自身认为十分自然的时候，学习就进入了有效的深度学习阶段。我们经常看到，孩子在玩乐高积木时一玩就是一个小时，吃饭喝水上厕所都给忘了，这时候孩子就已经进入了深度专注的状态。培养孩子这种自发的注意力，才是关键。 注意力训练场景注意力的形成是一个体系化过程，需要创造一定的环境，以及一定的刻意练习。 但这并不代表只有专业人士才能训练孩子的注意力。只要家长掌握了一定的原理和方法，就可以从生活中找到很多机会去训练孩子的注意力。 尤其是那些被手机侵占的碎片时间，用来做注意力的训练，最合适不过。 等车、排队、学习间歇等碎片时间，跟孩子玩一些有趣的游戏，用孩子喜欢的方式去加强注意力的训练，不知不觉中，孩子的注意力，就“高人一等”了。 等车、坐车等车或坐车时，由于不方便使用道具，所以最好的注意力训练道具就是周围所能看到的一切。 让孩子找车牌号码中的某个数字，找店铺招牌上的某个文字，找这个路口的路牌在哪里，找红绿灯周围有没有摄像头……路上的一切，都可以用来提高孩子的注意力。 平时跟娇娇玩的时候，我就发现，她找出来的数量越多，越兴奋，越想玩，就越专注去找，不知不觉中，就已经进入深度专注。 这个游戏成为我和娇娇等车、坐车的主旋律之后，她的各种无聊、晕车、扭捏，都不见踪影了。 排队、等吃饭1、妈妈背包里有什么：一般出行，为了训练孩子注意力特意拿上道具，没太大必要。妈妈的背包，就是一个很好的道具。让孩子看3-5秒钟背包里有什么物品，然后拉上背包拉链，问孩子背包里头有什么。每玩一次，可以将背包里的某一样物品拿出来之后，再跟孩子玩下一轮。除了说出物品名称之外，还可以让孩子说说物品的颜色，换着法子玩。这个游戏，注意力、观察力、记忆力都能加强，一举三得。 2、接数字：玩这个游戏的孩子一定要达到能流利数数的阶段，特别适合在幼儿园刚刚学了数字的孩子。家长说出几个数字，孩子要接着往下数出一样多的数。例如，家长说1、2、3，孩子就要说4、5、6；家长说7、8，宝宝就要说9、10…这个游戏不仅能训练孩子的专注力，还可以引导孩子学会更多的数字。 3、大小西瓜：这个游戏至少需要3个人，最好拉上爸爸一起玩。第一个人当排头，说“大西瓜”，但两手比成小西瓜的样子；接着第二个人说：“小西瓜”，但两手比成大西瓜的样子，依次直到最后一人。类似的游戏还有，妈妈说“左手”，孩子举起右手；妈妈说“往前一步”，孩子就向后一步。这种类型的游戏，可以破除思维的定式和思维惯性，也是训练孩子专注力的一种方法。 学习间歇、写完作业1、抓手指游戏：妈妈可以随意从书上找一段文字，找到文字里出现频率较高的某一个字。如：弯弯的月儿小小的船。小小的船儿两头尖。我在小小的船里坐，只看见闪闪的星星蓝蓝的天。让孩子把食指放在妈妈的掌心附近，当妈妈念到文字里的“小”字时，妈妈就会抓孩子的食指，孩子听到“小”字时就要快速抽离食指躲避。每次玩这个游戏时，家里总是一片笑声。娇娇长时间学习后紧张的神经，也会因为这个游戏小小的刺激而放松很多，然后又能很好地投入到下一阶段的学习。 2、衣服拍一下、食物拍两下：这个游戏可以结合语文、英语等学习过的词汇来玩。在一年级的英语里，每一个单元学习的都是相同类型物品的词汇，妈妈就可以挑出一组衣服类的单词，和一组食物类的单词，混合在一起。当妈妈念到衣服类的单词时，孩子拍一下掌，当妈妈念到食物类的单词时，孩子拍两下掌。这样既能让孩子在学习间隙放松，又无形中帮助孩子强化所学到的单词。效果杠杠的。 3、6的倍数：这个游戏适合大一点的孩子，跟大人一起玩。一人说一个数，但是轮到带有6的数字，以及6的倍数的数字的人，就不能说话，用拍一下掌代替。这个游戏，非常锻炼孩子的注意力和大脑的运算能力，大人有时候都会算错哦。 法国生物学家乔治.居维叶说：“天才，首先是注意力。” 这个注意力，应该是孩子自发的、自然集中的注意力，而非大人强迫的。 把孩子被手机偷走的那些碎片时间，拿来跟孩子一起玩这些有趣的注意力训练游戏，孩子一定能在游戏中，不知不觉地，玩出一身专注的能力，玩出一个不一样的未来。 来源：娇娇妈（ID: jiaojiaoma8）","comments":true,"tags":[{"name":"未分类","slug":"未分类","permalink":"http://forvoyager.github.io/tags/未分类/"}]},{"title":"代码生成器","date":"2019-06-14T09:01:02.000Z","path":"2019/06/14/代码生成器/","text":"节省时间去陪老婆，就靠你了…… 代码生成工具用于在项目开发过程中生成mapper, mapper xml, dao, service, controller等基础代码，让开发人员不必花费过多的时间在这些基础代码的开发上。 目前生成的是微服务架构代码格式，如果需要MVC风格代码，忽略掉*-client-starter模块的内容即可。 先贴代码…… 使用方法代码信息配置在CodeGenerator类中按照项目/模块的需要，配置好项目信息、作者信息及数据库信息，然后添加需要生成基础代码的表。 12345678910111213141516171819202122232425// 项目名称String projectName = \"micro_service\";// 基础包名String basePackageName = \"com.xr\";// 模块名称String moduleName = \"account\";// 模块名前缀String modulePrefix = \"ms-\";// 作者String author = \"forvoyager@outlook.com\";// 代码存放路径String outputPath = \"./code\";// 数据库配置String url = \"jdbc:mysql://localhost:3306/ms_account_db?characterEncoding=UTF-8\";String driver = \"com.mysql.jdbc.Driver\";String username = \"root\";String password = \"123456\";// 需要去掉的表前缀String skipTablePrefix = \"ms_\";// 需要生成代码的表List&lt;String&gt; tables = new ArrayList&lt;String&gt;();tables.add(\"ms_account\");tables.add(\"ms_user_level\"); 注： 表及字段信息会从数据库获取，所以建表要规范，相关备注、默认值等配置好。 表名中如果有下划线，会转换为驼峰命名规则，如表：ms_funds_data生成的代码形如FundsDataModel，字段名不受此影响。 生成代码执行com.xr.code.generate.CodeGenerator类，会在指定路径（默认是在当前项目路径下）生成代码文件。 最终生成的代码样例123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657micro_service └─ms-account ├─ms-account-client-starter │ └─src │ └─main │ └─java │ └─com │ └─xr │ └─account │ └─client │ AccountClient.java │ UserLevelClient.java │ ├─ms-account-common │ └─src │ └─main │ └─java │ └─com │ └─xr │ └─account │ └─common │ ├─controller │ │ IAccountController.java │ │ IUserLevelController.java │ │ │ └─model │ AccountModel.java │ UserLevelModel.java │ └─ms-account-service └─src └─main ├─java │ └─com │ └─xr │ └─account │ ├─controller │ │ AccountController.java │ │ UserLevelController.java │ │ │ ├─mapper │ │ AccountMapper.java │ │ UserLevelMapper.java │ │ │ └─service │ │ IAccountService.java │ │ IUserLevelService.java │ │ │ └─impl │ AccountServiceImpl.java │ UserLevelServiceImpl.java │ └─resources └─mybatis └─mapper account.xml userLevel.xml 其他一些约定 默认所有表都有如下三个字段 123create_time 创建时间update_time 最后修改时间version 数据版本号（用于乐观锁实现） 所有表的更新操作，版本号自动++ 1UPDATE `table` SET version = version + 1 项目中如下路径的文件是代码模板文件，按需调整。 1code-generator/src/main/resources/tpl 项目中如下路径的文件是mybatis基础配置文件，按需调整。 1code-generator/src/main/resources/mybatis 项目中如下路径的文件是mapper和service的基础文件，按需调整。 1code-generator/src/main/java/com/xr/base/core/service","comments":true,"tags":[{"name":"JAVA","slug":"JAVA","permalink":"http://forvoyager.github.io/tags/JAVA/"}]},{"title":"github+hexo构建个人博客","date":"2019-06-13T06:12:45.000Z","path":"2019/06/13/github-hexo构建个人博客/","text":"第一篇就写你吧…… 安装Node.js具体安装过程此处不赘述，见官方文档，安装完成后执行下面命令验证是否安装成功： 12&gt;node -vv8.7.0 安装Git这个过程就不赘述了，见官方文档，安装完成后执行下面命令验证是否安装成功： 12&gt;git --versiongit version 2.12.2.windows.2 安装Hexo安装按顺序执行下面命令，进行安装： 12345npm install hexo-cli -ghexo init blogcd blognpm installhexo server 注：blog是文件夹名字，根据需要自行修改。 按照上面步骤操作，没有报错，正常安装完成后，访问下面地址，能打开说明安装成功。http://localhost:4000/ blog目录中的文件及目录结构（只列了第一级目录）如下所示： 1234567891011E:\\blog│├─node_modules├─public├─scaffolds├─source├─themes├─config.yml├─db.json├─package.json└─package-lock.json 主题设置默认的主题有点丑，换一个主题吧，以hexo-theme-yilia主题为例，更多主题…… 下载主题操作步骤如下： 123cd blog/themeshexo cleangit clone https://github.com/litten/hexo-theme-yilia.git yilia 修改配置修改blog目录下的_config.yml配置文件。 将theme属性，设置为yilia。 在文件最后添加如下配置，显示文章目录。123456789101112131415161718jsonContent: meta: false pages: false posts: title: true date: true path: true text: false raw: false content: false slug: false updated: false comments: false link: false permalink: false excerpt: false categories: false tags: true 生成目录： 1npm i hexo-generator-json-content --save 验证主题启动本地web服务器： 1hexo server 访问http://localhost:4000/，查看新主题效果。 写文章文章是markdown文档 创建文章执行命令：1hexo new &quot;文章标题&quot; 然后会在source/_posts路径下生成markdown文件。写文章就是按markdown语法编辑此文件。 如果文章太长，可以在文章中任意你想截断的位置加上如下描述： 1&lt;!-- more --&gt; 文章会在此处截断，文章列表页显示截断之前的内容，点击“查看全文”后显示全部内容。 发布博客创建github账户并配置 注册账号，传送门…… 创建仓库 Repository name必须是这种形式：{username}.github.io 配置hexo 修改blog目录下的_config.yml配置文件中的deploy项为如下形式： 12345deploy: type: git repo: &#123;上面创建的仓库地址，如：https://github.com/username/username.github.io.git&#125; branch: master message: &quot;git commit时的备注信息，自行调整&quot; 发布执行下面命令，发布博客，其实就是生成博客页面，然后上传到github仓库中。 1hexo clean &amp;&amp; hexo deploy 提交过程中会提示输入github用户名和密码。 访问博客传送门","comments":true,"tags":[{"name":"未分类","slug":"未分类","permalink":"http://forvoyager.github.io/tags/未分类/"}]}]